spec/cassettes/StripeWrapper/_create/with_valid_card_number/charges_the_card.yml

---
http_interactions:
- request:
    method: post
    uri: https://api.stripe.com/v1/tokens
    body:
      encoding: UTF-8
      string: card[number]=4242424242424242&card[exp_month]=10&card[exp_year]=2018&card[cvc]=314
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.7.0
      Authorization:
      - Bearer sk_test_mOcn0ESCsNyhdadkVcd8vFoU
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.7.0","lang":"ruby","lang_version":"2.2.8 p477 (2017-09-14)","platform":"x86_64-darwin17","engine":"ruby","publisher":"stripe","uname":"Darwin
        DAVIDs-MacBook-Air.local 17.0.0 Darwin Kernel Version 17.0.0: Thu Aug 24 21:48:19
        PDT 2017; root:xnu-4570.1.46~2/RELEASE_X86_64 x86_64","hostname":"DAVIDs-MacBook-Air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 02 Nov 2017 01:59:45 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '782'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_8cLWVWWBFrQxAw
      Stripe-Version:
      - '2017-08-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "tok_1BJXzhACRY9yqAzK6Uy31yZN",
          "object": "token",
          "card": {
            "id": "card_1BJXzhACRY9yqAzK9bwcok47",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "cvc_check": "unchecked",
            "dynamic_last4": null,
            "exp_month": 10,
            "exp_year": 2018,
            "fingerprint": "q2TyZusZTFXy5XkY",
            "funding": "credit",
            "last4": "4242",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "client_ip": "67.160.218.184",
          "created": 1509587985,
          "livemode": false,
          "type": "card",
          "used": false
        }
    http_version: 
  recorded_at: Thu, 02 Nov 2017 02:00:03 GMT
- request:
    method: post
    uri: https://api.stripe.com/v1/charges
    body:
      encoding: UTF-8
      string: amount=999&source=tok_1BJXzhACRY9yqAzK6Uy31yZN&currency=usd
    headers:
      User-Agent:
      - Stripe/v1 RubyBindings/3.7.0
      Authorization:
      - Bearer sk_test_mOcn0ESCsNyhdadkVcd8vFoU
      Content-Type:
      - application/x-www-form-urlencoded
      X-Stripe-Client-User-Agent:
      - '{"bindings_version":"3.7.0","lang":"ruby","lang_version":"2.2.8 p477 (2017-09-14)","platform":"x86_64-darwin17","engine":"ruby","publisher":"stripe","uname":"Darwin
        DAVIDs-MacBook-Air.local 17.0.0 Darwin Kernel Version 17.0.0: Thu Aug 24 21:48:19
        PDT 2017; root:xnu-4570.1.46~2/RELEASE_X86_64 x86_64","hostname":"DAVIDs-MacBook-Air.local"}'
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      Accept:
      - "*/*"
  response:
    status:
      code: 200
      message: OK
    headers:
      Server:
      - nginx
      Date:
      - Thu, 02 Nov 2017 01:59:46 GMT
      Content-Type:
      - application/json
      Content-Length:
      - '1740'
      Connection:
      - keep-alive
      Access-Control-Allow-Credentials:
      - 'true'
      Access-Control-Allow-Methods:
      - GET, POST, HEAD, OPTIONS, DELETE
      Access-Control-Allow-Origin:
      - "*"
      Access-Control-Expose-Headers:
      - X-Stripe-Privileged-Session-Required,stripe-manage-version,X-Stripe-External-Auth-Required
      Access-Control-Max-Age:
      - '300'
      Cache-Control:
      - no-cache, no-store
      Request-Id:
      - req_OJKkz1mUesP2dO
      Stripe-Version:
      - '2017-08-15'
      Strict-Transport-Security:
      - max-age=31556926; includeSubDomains
    body:
      encoding: UTF-8
      string: |
        {
          "id": "ch_1BJXzhACRY9yqAzK34iiHo5I",
          "object": "charge",
          "amount": 999,
          "amount_refunded": 0,
          "application": null,
          "application_fee": null,
          "balance_transaction": "txn_1BJXziACRY9yqAzK6fFUD2PT",
          "captured": true,
          "created": 1509587985,
          "currency": "usd",
          "customer": null,
          "description": null,
          "destination": null,
          "dispute": null,
          "failure_code": null,
          "failure_message": null,
          "fraud_details": {},
          "invoice": null,
          "livemode": false,
          "metadata": {},
          "on_behalf_of": null,
          "order": null,
          "outcome": {
            "network_status": "approved_by_network",
            "reason": null,
            "risk_level": "normal",
            "seller_message": "Payment complete.",
            "type": "authorized"
          },
          "paid": true,
          "receipt_email": null,
          "receipt_number": null,
          "refunded": false,
          "refunds": {
            "object": "list",
            "data": [],
            "has_more": false,
            "total_count": 0,
            "url": "/v1/charges/ch_1BJXzhACRY9yqAzK34iiHo5I/refunds"
          },
          "review": null,
          "shipping": null,
          "source": {
            "id": "card_1BJXzhACRY9yqAzK9bwcok47",
            "object": "card",
            "address_city": null,
            "address_country": null,
            "address_line1": null,
            "address_line1_check": null,
            "address_line2": null,
            "address_state": null,
            "address_zip": null,
            "address_zip_check": null,
            "brand": "Visa",
            "country": "US",
            "customer": null,
            "cvc_check": "pass",
            "dynamic_last4": null,
            "exp_month": 10,
            "exp_year": 2018,
            "fingerprint": "q2TyZusZTFXy5XkY",
            "funding": "credit",
            "last4": "4242",
            "metadata": {},
            "name": null,
            "tokenization_method": null
          },
          "source_transfer": null,
          "statement_descriptor": null,
          "status": "succeeded",
          "transfer_group": null
        }
    http_version: 
  recorded_at: Thu, 02 Nov 2017 02:00:04 GMT
recorded_with: VCR 3.0.0
